; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_6_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 - counter
	)
  (:init
		(= (value c0) 44)
	(= (value c1) 43)
	(= (value c2) 10)
	(= (value c3) 84)
	(= (value c4) 21)
	(= (value c5) 41)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
		)
	)
)

; plan
1. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 2 of 5
2. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 2 of 5
3. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 2 of 5
4. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 2 of 5
5. (increase_rate c2)
   changed: (rate_value c2) from 4 to 5
   goals met: 2 of 5
6. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 2 of 5
7. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 2 of 5
8. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 2 of 5
9. (increment c2)
   changed: (value c2) from 10 to 15
   goals met: 2 of 5
10. (increase_rate c2)
   changed: (rate_value c2) from 5 to 6
   goals met: 2 of 5
11. (increment c1)
   changed: (value c1) from 43 to 46
   goals met: 3 of 5
12. (increment c2)
   changed: (value c2) from 15 to 21
   goals met: 3 of 5
13. (increment c2)
   changed: (value c2) from 21 to 27
   goals met: 3 of 5
14. (increment c2)
   changed: (value c2) from 27 to 33
   goals met: 3 of 5
15. (increment c2)
   changed: (value c2) from 33 to 39
   goals met: 3 of 5
16. (increment c2)
   changed: (value c2) from 39 to 45
   goals met: 3 of 5
17. (increment c2)
   changed: (value c2) from 45 to 51
   goals met: 4 of 5
18. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 4 of 5
19. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 4 of 5
20. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 4 of 5
21. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 4 of 5
22. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 4 of 5
23. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 4 of 5
24. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 4 of 5
25. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 4 of 5
26. (increase_rate c4)
   changed: (rate_value c4) from 5 to 6
   goals met: 4 of 5
27. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 4 of 5
28. (increment c4)
   changed: (value c4) from 21 to 27
   goals met: 4 of 5
29. (increment c4)
   changed: (value c4) from 27 to 33
   goals met: 4 of 5
30. (increase_rate c4)
   changed: (rate_value c4) from 6 to 7
   goals met: 4 of 5
31. (increment c4)
   changed: (value c4) from 33 to 40
   goals met: 4 of 5
32. (increment c4)
   changed: (value c4) from 40 to 47
   goals met: 3 of 5
33. (increase_rate c4)
   changed: (rate_value c4) from 7 to 8
   goals met: 3 of 5
34. (increment c4)
   changed: (value c4) from 47 to 55
   goals met: 3 of 5
35. (decrement c3)
   changed: (value c3) from 84 to 80
   goals met: 3 of 5
36. (increase_rate c4)
   changed: (rate_value c4) from 8 to 9
   goals met: 3 of 5
37. (increase_rate c4)
   changed: (rate_value c4) from 9 to 10
   goals met: 3 of 5
38. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 3 of 5
39. (decrement c4)
   changed: (value c4) from 55 to 45
   goals met: 3 of 5
40. (decrement c3)
   changed: (value c3) from 80 to 75
   goals met: 3 of 5
41. (decrement c4)
   changed: (value c4) from 45 to 35
   goals met: 4 of 5
42. (decrement c3)
   changed: (value c3) from 75 to 70
   goals met: 4 of 5
43. (decrement c3)
   changed: (value c3) from 70 to 65
   goals met: 4 of 5
44. (increase_rate c3)
   changed: (rate_value c3) from 5 to 6
   goals met: 4 of 5
45. (increment c4)
   changed: (value c4) from 35 to 45
   goals met: 3 of 5
46. (decrement c3)
   changed: (value c3) from 65 to 59
   goals met: 3 of 5
47. (decrement c4)
   changed: (value c4) from 45 to 35
   goals met: 4 of 5
48. (increase_rate c3)
   changed: (rate_value c3) from 6 to 7
   goals met: 4 of 5
49. (decrement c3)
   changed: (value c3) from 59 to 52
   goals met: 4 of 5
50. (increase_rate c3)
   changed: (rate_value c3) from 7 to 8
   goals met: 4 of 5
51. (increment c4)
   changed: (value c4) from 35 to 45
   goals met: 3 of 5
52. (increment c4)
   changed: (value c4) from 45 to 55
   goals met: 4 of 5
53. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 4 of 5
54. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 4 of 5
55. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 4 of 5
56. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 4 of 5
57. (increase_rate c5)
   changed: (rate_value c5) from 4 to 5
   goals met: 4 of 5
58. (increment c5)
   changed: (value c5) from 41 to 46
   goals met: 4 of 5
59. (increment c5)
   changed: (value c5) from 46 to 51
   goals met: 4 of 5
60. (increment c5)
   changed: (value c5) from 51 to 56
   goals met: 5 of 5
